{
    "Name": "IoTUtilities - Privacy Notice - EN/US",
    "Author": "Jens Fluegel",
    "Version": "Version 1.0.0",

    "AdditionalHeaderTitle": "Privacy Statement for this Application",
    "AdditionalHeaderContent": "Protecting your privacy as an app user is a high priority. This document explains how personal data and none-personal data is handled with regards tothe “IoT-Utilities” app,hereinafterreferred to as \"app\". “Personal data” means all information that relates to an identified or identifiable natural person.",

    "Sections": [
        {
            "IconDrawableName": "ic_baseline_account_circle_24",
            "SectionTitle": "Who is the provider of this app and who is responsible for processing your personal data?",
            "SectionContent": "The controller for the data processing and the contact for questions or suggestions regarding the app is:\n\nJens Flügel\nVor dem Steintor 4\n38871 Ilsenburg (Harz)\nE-Mail: iot-utilities@arubademo.de"
        },
        {
            "IconDrawableName": "ic_baseline_view_carousel_24",
            "SectionTitle":"What is the purpose of this app?",
            "SectionContent":"The app is used to demonstrate and test the \"Aruba IoT Interface\" functionality. More information about this functionality and its specification can be found here:\n\nAruba Support Portal\nhttps://asp.arubanetworks.com/downloads;search=iot\n\nArubaOS WLAN and Aruba Instant 8.6.0.x IoT Interface Guide\nhttps://support.hpe.com/hpesc/public/docDisplay?docId=a00100259en_us\n\nThe app also offers other functions and tools, such as \"Bluetooth Scanning\" and \"Bluetooth Advertising\"."
        },
        {
            "IconDrawableName": "ic_baseline_build_24",
            "SectionTitle":"What features does this app offer?",
            "SectionContent":"a) IoT-Server\nThe app provides an IoT-server function that accepts connections from Aruba controllers and Aruba Instant access points via the Aruba IoT interface protocol. The IoT-server only allows (TLS/SSL) encrypted connections, which are authorized or authenticated via static access tokens or username and password. The required SSL server certificate can be imported into the app or a self-signed certificate can be generated.\nThe IoT-server also provides a web dashboard via a (TLS/SSL) encrypted connection under the URL \"https: //[smartphone IP address]:[port]/dashboard\". Access to the dashboard is secured using a username/password combination assigned in the app settings.\n\nb) Bluetooth Scanning\nThis function of the app shows all Bluetooth Low Energy (BLE) devices in range of the smartphone in a list. A Bluetooth-enabled smartphone is required for this capability. Detailed information about the recorded BLE devices are also available.\n\nc) Bluetooth Advertising\nWith this function, the smartphone works as a Bluetooth transmitter. Various Bluetooth packages, so-called advertisements, can be created and sent. There are different Bluetooth protocols, e.g. iBeacon or Eddystone available."
        },
        {
            "IconDrawableName": "ic_baseline_privacy_tip_24",
            "SectionTitle": "What is the purpose and the legal basis for the data collection and processing (Art. 6 GDPR)?",
            "SectionContent": "The data processing takes place for the following purposes and on the following legal basis:\n\n-  Exclusively for the provision of the app and its functionalities to the extent required for this (Art. 6 Para. 1 b) GDPR). Personal data are generally deleted as soon as further processing is no longer necessary for the purposes of contract implementation.\n\n-  If consent has been given for data processing to the extent specified in this privacy statement (Art. 6 Para. 1 a) GDPR).\n\nConsent to data processing can be given when the app is started for the first time. The app cannot be used without consent. Consents are always voluntary and can be freely revoked at any time. To revoke the consent the app has to be uninstalled or the app data being deleted under:\n\nAndroid:\nSettings -> Apps -> IoT Utilities -> Uninstall\n\nSettings -> Apps -> IoT Utilities -> Storage -> Erase data\n\nA revocation does not affect the legality of the data processing carried out based on the consent until the revocation."
        },
        {
            "IconDrawableName": "ic_baseline_vpn_key_24",
            "SectionTitle": "Which permissions does this app need?",
            "SectionContent": "This app requires permissions to access functions and data on the smartphone to provide its functions, which must be granted when the app is installed. If these permissions are not granted, certain functions are not available, or the app cannot be used at all.Depending on the operating system, app permissions are partially granted automatically or, in the event of potentially dangerous access, e.g. to sensitive data such as position data are explicitly given by the user. In particular, the app uses data that is entered and, if permitted, data that is available on the device or that is generated by using device functions.\n\nThe following authorizations are required and requested when installing or starting the app for the first time:\n\na)  Location\nAndroid permissions (user query):\n[android.permission.access_coarse_location]\n[android.permission.access_fine_location]\n\nThis app requires access to the location function of the device. This permission is required to access the Bluetooth Low Energy (BLE) interface of the smartphone. No location information is retrieved or saved by the app.\n\nb)  Storage (read / write)\nAndroid permissions (user query):\n[android.permission.write_external_storage]\n[android.permission.read_external_storage]\n\nThe app requires read and write access to the external memory of your smartphone in order to be able to save temporary files for various functions as well as configuration files.\n\nc)  Bluetooth\nAndroid permissions (granted automatically):\n[android.hardware.bluetooth_le]\n[android.permission.bluetooth]\n[android.permission.bluetooth_admin]\n\nThis app requires access to the smartphone's Bluetooth system in order to be able to provide the \"Bluetooth scanning\" and \"Bluetooth advertising\" functions.\n\nd)  Internet\nAndroid permissions (granted automatically):\n[android.permission.internet]\n\nThis app requires access to the device's Internet connection in order to be able to provide the \"IoT-server\" function and to download the BLE MAC manufacturer list from the Internet (optional).\n\ne)  Wi-Fi and network information\nAndroid permissions (granted automatically):\n[android.permission.access_wifi_state]\n[android.permission.access_network_state]\n\nThis app requires access to the network information of the smartphone in order to be able to provide the \"IoT server\" function.\n\n\nThe granted permissions can be viewed/granted/withdrawn at any time in the app under Settings -> Authorizations or in the device settings:\n\nAndroid:\nSettings -> Apps -> IoT Utilities -> Permissions"
        },
        {
            "IconDrawableName": "ic_notifications_black_24dp",
            "SectionTitle": "When and how are push notifications used?",
            "SectionContent": "The app uses push notification to show the status of the “Bluetooth Advertising” and “IoT-server” function.\n\nThe push notification may be deactivated and reactivated at any time at:\n\nAndroid: System Settings: -> Apps -> IoT-Utilities -> App notifications"
        },
        {
            "IconDrawableName": "ic_baseline_data_usage_24",
            "SectionTitle": "Which data is collected, processed and saved by the app and for what purpose?",
            "SectionContent": "When downloading an app, the required information is transferred to the respective app store, in particular the username, email address, customer ID at the app store and the individual device ID. We have no influence on the collection and processing of this data. The operator of the respective app store is responsible for this.\n\nThis app does not use personal data (privacy by design) unless these are essential for the app to function.\n\nThe app does not store any data permanently, neither personal nor non-personal.\n\nThe following data is recorded and processed by the app\n\na)  Personal data (user)\n\nIP addressTo provide the \"IoT server\" function, the app queries the current IP address of the smartphone and uses it as the server IP address. The IP address is also dynamically inserted into configuration templates when these are retrieved and displayed by the user in the app. These configuration templates help to configure the Aruba Wi-Fi components to send data via the Aruba IoT interface to the \"IoT server\" function of the app.\nIn addition, the IP address in the app's log data is used for troubleshooting and error correction. The IP address is only used for as long as the app is being used and is not stored permanently. The log data is deleted as soon as the app is closed.If the user copies the IP address from the app and continues to use it, e.g. when using the configuration templates, this is outside of responsibility of this app and the user is responsible for protecting the data accordingly.\n\nb)  Personal data (third party)\n\nIP address\nThe “IoT server” function of the app provides a web server for establishing a connection between Aruba Controllers and Aruba Instant Access Points via the Aruba IoT interface protocol, as well as for a web-based dashboard. When establishing a connection to the app's web server, the connection information including the client's IP address is recorded. The IP address is only recorded for as long as the app is used and is not stored permanently. The log data of the web server is deleted as soon as the app is closed.\n\nBLE MAC addresses\nThe “Bluetooth Scanner” function of the app detects and displays all Bluetooth Low Energy (BLE) devices in range of the smartphone including the BLE MAC address of the respective devices. The recorded data is only displayed in the app on the local device if in use. Closing the app deletes all received data. No data is saved.\n\nAruba IoT telemetry data\nThe \"IoT server\" function of the app provides the capability to receive and display data from third-party Aruba devices via the Aruba IoT interface. The received data can include personal data, in particular:\n\n-   MAC addresses of Bluetooth devices\n\nThe controller of the data processing of the data transmitted to the app through the Aruba IoT interface is the owner of the third-party system. The user of the app processes the data in accordance with Art. 28 GDPR as a processor.\n\nThe security of the data transmitted via the Aruba IoT interface is ensured by a (TLS / SSL) encrypted connection between the app and the third-party systems.\n\nThe data received by the \"IoT server\" function of the app is only displayed in the app on the local device as long as it is used. When the app is closed, all received data is deleted. No data is saved.\n\nc)  Non-personal information\n\nLog data generated by the app is used for troubleshooting and error correstion and is only displayed on the local device as long as the app is used. All log data is deleted when the app is closed. No data is stored permanently."
        },
        {
            "IconDrawableName": "ic_baseline_save_alt_24",
            "SectionTitle": "What data is stored on the device?",
            "SectionContent": "The app stores the following data on the device to fulfill its function:\n\n- List of Bluetooth manufacturer IDs\n- configuration templates\n- exported configuration templates\n- exports certificates\n- exports log files\n- temporary data\n- Bluethooth Advertiser Database"
        },
        {
            "IconDrawableName": "ic_baseline_more_time_24",
            "SectionTitle": "How long will the data be stored?",
            "SectionContent": "All personal data that this app uses during runtime is deleted as soon as the app is closed by the user. No personal data is stored permanently.\n\nData that is stored in the file storage of the smartphone, e.g. configuration files are saved until the app will uninstalled or the files are manually deleted."
        },
        {
            "IconDrawableName": "ic_baseline_delete_forever_24",
            "SectionTitle": "How can user data be deleted in the app?",
            "SectionContent": "The data is deleted when the app is uninstalled or can be deleted manually at any time under:\n\nAndroid: Settings -> Apps -> IoT Utilities -> Storage -> Delete data."
        },
        {
            "IconDrawableName": "ic_baseline_share_24",
            "SectionTitle": "Will data be passed on to third parties?",
            "SectionContent": "The app's data processing takes place exclusively locally on the installed device and only as long as the app is used or runs in the background.The app does not store or transmit any personal or other data to HPE, the developer or third parties. Furthermore, this app does not use any analysis or advertising services from Google or other providers."
        },
        {
            "IconDrawableName": "ic_baseline_timeline_24",
            "SectionTitle": "Is the usage behavior/user data evaluated by tracking tools?",
            "SectionContent": "Neither the usage behavior nor the data of the user are processed or analyzed by tracking tools or the like. Your personal data will not be processed for automated individual decisions including profiling within the meaning of Art. 22 Para. 1 GDPR and Art. 4 GDPR."
        },
        {
            "IconDrawableName": "ic_baseline_supervised_user_circle_24",
            "SectionTitle": "What rights to I have? (Rights of the data subject, GDRP)",
            "SectionContent": "If you have declared your consent for any personal data processing activities, you can withdraw this consent at any time with future effect. Such a withdrawal will not affect the lawfulness of the processing prior to the consent withdrawal. \n\nPursuant to applicable data protection law as a data subject affected by data processing, you may have the following rights:\n\na)  Right to access (Art. 15 GDPR)\nYou have the right to access regarding the personal data being stored. This means that you have the right to obtain a confirmation as to whether or not personal data concerning you is processed, and, where that is the case, to request access to the personal data. The right of access includes – inter alia – the purposes of the processing, the categories of personal data concerned, and the recipients or categories of recipients to whom the personal data have been or will be disclosed. However, this is not an absolute right and the interests of other individuals may restrict your right of access. You may have the right to obtain a copy of the personal data undergoing processing.\n\nb)  Right to rectification (Art. 16 GDPR)\nYou may have the right to have incorrect personal data rectified. This means that you have the right to obtain from us the rectification of inaccurate personal data concerning you. Depending on the purposes of the processing, you may have the right to have incomplete personal data completed, including by means of providing a supplementary statement.\n\nc)  Right to erasure (‘right to be forgotten’) (Art. 17 GDPR)\nUnder certain circumstances you can request the deletion of your stored personal data and there is an obligation to delete the personal data, insofar as their processing is not necessary to exercise the right to freedom of expression and information, to fulfill a legal obligation, for reasons of public interest or to assert, exercise or defend legal claims.\n\nd)  Right to restriction of processing (Art. 18 GDPR)\nYou can request the restriction of the processing of your personal data if you dispute the accuracy of the data, the processing is unlawful, but you refuse to delete it. You also have this right if we no longer need the data, but you need them to assert, exercise or defend legal claims. You also have this right if you have objected to the processing of your personal data.\n\ne)  Right to data portability in accordance with Art. 20 GDPR\nYou can request that we transmit the personal data you have provided to us in a structured, common and machine-readable format. Alternatively, you can request the direct transmission of the personal data you have provided to another person responsible, as far as this is possible.\n\nf)  Right to object (Art. 21 GDPR)\nYou can revoke your consent to us at any time. The data processing based on the revoked consent may then no longer be continued in the future.\n\ng)  Right of appeal to a supervisory authority (Art. 77 Para. 1 GDPR)\nYou can complain to the supervisory authority responsible for us, e.g. if you believe that we are processing your personal data in an unlawful manner."
        },
        {
            "IconDrawableName": "ic_baseline_track_changes_24",
            "SectionTitle": "Changes to the privacy policy",
            "SectionContent": "This privacy statement reflects the status of the latest version of the app at the time of installation. If there are changes in the collection, processing or use of data due to new or changed functions of the app, this will be indicated when the app is updated and the user consents to the updated privacy statement will be requested. The current version of the privacy statement is always available in the app under:\nAbout -> Privacy Statement."
        }
    ]
}